Revit 2027 API
AssemblyDetailViewOrientation Enumeration
 Orientation of the Assembly Detail View.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AssemblyDetailViewOrientation
Public Enumeration AssemblyDetailViewOrientation
public enum class AssemblyDetailViewOrientation
type AssemblyDetailViewOrientation
Members
Member name | Value | Description
DetailSectionA | 1 |  The Detail View will be oriented vertically, looking north.
DetailSectionB | 2 |  The Detail View will be oriented vertically, looking west.
ElevationBack | 8 |  The Detail View will be oriented vertically, with its cut plane along the back face of the assembly's bounding box, looking into the bounding box.
ElevationBottom | 4 |  The Detail View will be oriented horizontally, with its cut plane along the bottom face of the assembly's bounding box, looking up into the bounding box.
ElevationFront | 7 |  The Detail View will be oriented vertically, with its cut plane along the front face of the assembly's bounding box, looking into the bounding box.
ElevationLeft | 5 |  The Detail View will be oriented vertically, with its cut plane along the left face of the assembly's bounding box, looking into the bounding box.
ElevationRight | 6 |  The Detail View will be oriented vertically, with its cut plane along the right face of the assembly's bounding box, looking into the bounding box.
ElevationTop | 3 |  The Detail View will be oriented horizontally, with its cut plane along the top face of the assembly's bounding box, looking down into the bounding box.
HorizontalDetail | 0 |  The Detail View will be oriented horizontally, looking down.
Remarks
 The orientation can be specified during creation but not modified for existing views.
See Also
Reference
Autodesk.Revit.DB Namespace